STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32H5xx/Source/Templates/arm/startup_stm32h5f4xx.s
;*******************************************************************************
;* File Name          : startup_stm32h5f4xx.s
;* Author             : MCD Application Team
;* Description        : STM32H5F5xx Crypto Devices vector
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == Reset_Handler
;*                      - Set the vector table entries with the exceptions ISR address
;*                      - Branches to __main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the Cortex-M33 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;*******************************************************************************
;* @attention
;*
;* Copyright (c) 2025 STMicroelectronics.
;* All rights reserved.
;*
;* This software is licensed under terms that can be found in the LICENSE file
;* in the root directory of this software component.
;* If no LICENSE file comes with this software, it is provided AS-IS.
;*
;*******************************************************************************
;* <<< Use Configuration Wizard in Context Menu >>>
;
; Amount of memory (in bytes) allocated for Stack
; Tailor this value to your application needs
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size		EQU     0x400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Heap_Size      EQU     0x200

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp                     ; Top of Stack
                DCD     Reset_Handler                    ; Reset Handler
                DCD     NMI_Handler                      ; NMI Handler
                DCD     HardFault_Handler                ; Hard Fault Handler
                DCD     MemManage_Handler                ; MPU Fault Handler
                DCD     BusFault_Handler                 ; Bus Fault Handler
                DCD     UsageFault_Handler               ; Usage Fault Handler
                DCD     SecureFault_Handler              ; Secure Fault Handler
                DCD     0                                ; Reserved
                DCD     0                                ; Reserved
                DCD     0                                ; Reserved
                DCD     SVC_Handler                      ; SVCall Handler
                DCD     DebugMon_Handler                 ; Debug Monitor Handler
                DCD     0                                ; Reserved
                DCD     PendSV_Handler                   ; PendSV Handler
                DCD     SysTick_Handler                  ; SysTick Handler
                ; External Interrupts
                DCD     WWDG_IRQHandler                  ; Window WatchDog
                DCD     PVD_AVD_IRQHandler               ; PVD/AVD through EXTI Line detection Interrupt
                DCD     RTC_IRQHandler                   ; RTC non-secure interrupt
                DCD     RTC_S_IRQHandler                 ; RTC secure interrupt
                DCD     TAMP_IRQHandler                  ; Tamper non-secure interrupt
                DCD     RAMCFG_IRQHandler                ; RAMCFG global
                DCD     FLASH_IRQHandler                 ; FLASH non-secure global interrupt
                DCD     FLASH_S_IRQHandler               ; FLASH secure global interrupt
                DCD     GTZC_IRQHandler                  ; Global TrustZone Controller interrupt
                DCD     RCC_IRQHandler                   ; RCC non-secure global interrupt
                DCD     RCC_S_IRQHandler                 ; RCC secure global interrupt
                DCD     EXTI0_IRQHandler                 ; EXTI Line0 interrupt
                DCD     EXTI1_IRQHandler                 ; EXTI Line1 interrupt
                DCD     EXTI2_IRQHandler                 ; EXTI Line2 interrupt
                DCD     EXTI3_IRQHandler                 ; EXTI Line3 interrupt
                DCD     EXTI4_IRQHandler                 ; EXTI Line4 interrupt
                DCD     EXTI5_IRQHandler                 ; EXTI Line5 interrupt
                DCD     EXTI6_IRQHandler                 ; EXTI Line6 interrupt
                DCD     EXTI7_IRQHandler                 ; EXTI Line7 interrupt
                DCD     EXTI8_IRQHandler                 ; EXTI Line8 interrupt
                DCD     EXTI9_IRQHandler                 ; EXTI Line9 interrupt
                DCD     EXTI10_IRQHandler                ; EXTI Line10 interrupt
                DCD     EXTI11_IRQHandler                ; EXTI Line11 interrupt
                DCD     EXTI12_IRQHandler                ; EXTI Line12 interrupt
                DCD     EXTI13_IRQHandler                ; EXTI Line13 interrupt
                DCD     EXTI14_IRQHandler                ; EXTI Line14 interrupt
                DCD     EXTI15_IRQHandler                ; EXTI Line15 interrupt
                DCD     GPDMA1_Channel0_IRQHandler       ; GPDMA1 Channel 0 global interrupt
                DCD     GPDMA1_Channel1_IRQHandler       ; GPDMA1 Channel 1 global interrupt
                DCD     GPDMA1_Channel2_IRQHandler       ; GPDMA1 Channel 2 global interrupt
                DCD     GPDMA1_Channel3_IRQHandler       ; GPDMA1 Channel 3 global interrupt
                DCD     GPDMA1_Channel4_IRQHandler       ; GPDMA1 Channel 4 global interrupt
                DCD     GPDMA1_Channel5_IRQHandler       ; GPDMA1 Channel 5 global interrupt
                DCD     GPDMA1_Channel6_IRQHandler       ; GPDMA1 Channel 6 global interrupt
                DCD     GPDMA1_Channel7_IRQHandler       ; GPDMA1 Channel 7 global interrupt
                DCD     IWDG_IRQHandler                  ; IWDG global interrupt
                DCD     SAES_IRQHandler                  ; SAES global interrupt
                DCD     ADC1_IRQHandler                  ; ADC1 global interrupt
                DCD     DAC1_IRQHandler                  ; DAC1 global interrupt
                DCD     FDCAN1_IT0_IRQHandler            ; FDCAN1 interrupt 0
                DCD     FDCAN1_IT1_IRQHandler            ; FDCAN1 interrupt 1
                DCD     TIM1_BRK_IRQHandler              ; TIM1 Break interrupt
                DCD     TIM1_UP_IRQHandler               ; TIM1 Update interrupt
                DCD     TIM1_TRG_COM_IRQHandler          ; TIM1 Trigger and Commutation interrupt
                DCD     TIM1_CC_IRQHandler               ; TIM1 Capture Compare interrupt
                DCD     TIM2_IRQHandler                  ; TIM2 global interrupt
                DCD     TIM3_IRQHandler                  ; TIM3 global interrupt
                DCD     TIM4_IRQHandler                  ; TIM4 global interrupt
                DCD     TIM5_IRQHandler                  ; TIM5 global interrupt
                DCD     TIM6_IRQHandler                  ; TIM6 global interrupt
                DCD     TIM7_IRQHandler                  ; TIM7 global interrupt
                DCD     I2C1_EV_IRQHandler               ; I2C1 Event interrupt
                DCD     I2C1_ER_IRQHandler               ; I2C1 Error interrupt
                DCD     I2C2_EV_IRQHandler               ; I2C2 Event interrupt
                DCD     I2C2_ER_IRQHandler               ; I2C2 Error interrupt
                DCD     SPI1_IRQHandler                  ; SPI1 global interrupt
                DCD     SPI2_IRQHandler                  ; SPI2 global interrupt
                DCD     SPI3_IRQHandler                  ; SPI3 global interrupt
                DCD     USART1_IRQHandler                ; USART1 global interrupt
                DCD     USART2_IRQHandler                ; USART2 global interrupt
                DCD     USART3_IRQHandler                ; USART3 global interrupt
                DCD     UART4_IRQHandler                 ; UART4 global interrupt
                DCD     UART5_IRQHandler                 ; UART5 global interrupt
                DCD     LPUART1_IRQHandler               ; LPUART1 global interrupt
                DCD     LPTIM1_IRQHandler                ; LPTIM1 global interrupt
                DCD     TIM8_BRK_IRQHandler              ; TIM8 Break interrupt
                DCD     TIM8_UP_IRQHandler               ; TIM8 Update interrupt
                DCD     TIM8_TRG_COM_IRQHandler          ; TIM8 Trigger and Commutation interrupt
                DCD     TIM8_CC_IRQHandler               ; TIM8 Capture Compare interrupt
                DCD     ADC2_IRQHandler                  ; ADC2 global interrupt
                DCD     LPTIM2_IRQHandler                ; LPTIM2 global interrupt
                DCD     TIM15_IRQHandler                 ; TIM15 global interrupt
                DCD     TIM16_IRQHandler                 ; TIM16 global interrupt
                DCD     TIM17_IRQHandler                 ; TIM17 global interrupt
                DCD     0                                ; Reserved
                DCD     CRS_IRQHandler                   ; CRS global interrupt
                DCD     UCPD1_IRQHandler                 ; UCPD1 global interrupt
                DCD     FMC_IRQHandler                   ; FMC global interrupt
                DCD     OCTOSPI1_IRQHandler              ; OctoSPI1 global interrupt
                DCD     SDMMC1_IRQHandler                ; SDMMC1 global interrupt
                DCD     I2C3_EV_IRQHandler               ; I2C2 Event interrupt
                DCD     I2C3_ER_IRQHandler               ; I2C2 Error interrupt
                DCD     SPI4_IRQHandler                  ; SPI4 global interrupt
                DCD     SPI5_IRQHandler                  ; SPI5 global interrupt
                DCD     SPI6_IRQHandler                  ; SPI6 global interrupt
                DCD     USART6_IRQHandler                ; USART6 global interrupt
                DCD     USART10_IRQHandler               ; USART10 global interrupt
                DCD     USART11_IRQHandler               ; USART11 global interrupt
                DCD     SAI1_IRQHandler                  ; Serial Audio Interface 1 global interrupt
                DCD     SAI2_IRQHandler                  ; Serial Audio Interface 2 global interrupt
                DCD     GPDMA2_Channel0_IRQHandler       ; GPDMA2 Channel 0 global interrupt
                DCD     GPDMA2_Channel1_IRQHandler       ; GPDMA2 Channel 1 global interrupt
                DCD     GPDMA2_Channel2_IRQHandler       ; GPDMA2 Channel 2 global interrupt
                DCD     GPDMA2_Channel3_IRQHandler       ; GPDMA2 Channel 3 global interrupt
                DCD     GPDMA2_Channel4_IRQHandler       ; GPDMA2 Channel 4 global interrupt
                DCD     GPDMA2_Channel5_IRQHandler       ; GPDMA2 Channel 5 global interrupt
                DCD     GPDMA2_Channel6_IRQHandler       ; GPDMA2 Channel 6 global interrupt
                DCD     GPDMA2_Channel7_IRQHandler       ; GPDMA2 Channel 7 global interrupt
                DCD     UART7_IRQHandler                 ; UART7 global interrupt
                DCD     UART8_IRQHandler                 ; UART8 global interrupt
                DCD     UART9_IRQHandler                 ; UART9 global interrupt
                DCD     UART12_IRQHandler                ; UART12 global interrupt
                DCD     SDMMC2_IRQHandler                ; SDMMC2 global interrupt
                DCD     FPU_IRQHandler                   ; FPU global interrupt
                DCD     ICACHE_IRQHandler                ; Instruction cache global interrupt
                DCD     DCACHE1_IRQHandler               ; DCACHE1 global interrupt
                DCD     ETH_IRQHandler                   ; Ethernet global interrupt
                DCD     ETH_WKUP_IRQHandler              ; Ethernet Wakeup global interrupt
                DCD     DCMI_PSSI_IRQHandler             ; DCMI PSSI global interrupt
                DCD     FDCAN2_IT0_IRQHandler            ; FDCAN2 interrupt 0
                DCD     FDCAN2_IT1_IRQHandler            ; FDCAN2 interrupt 1
                DCD     CORDIC_IRQHandler                ; CORDIC global interrupt
                DCD     FMAC_IRQHandler                  ; FMAC global interrupt
                DCD     DTS_IRQHandler                   ; DTS global interrupt
                DCD     RNG_IRQHandler                   ; RNG global interrupt
                DCD     OTFDEC1_IRQHandler               ; OTFDEC1 global interrupt
                DCD     AES_IRQHandler                   ; AES global interrupt
                DCD     HASH_IRQHandler                  ; HASH global interrupt
                DCD     PKA_IRQHandler                   ; PKA global interrupt
                DCD     CEC_IRQHandler                   ; CEC global interrupt
                DCD     TIM12_IRQHandler                 ; TIM12 global interrupt
                DCD     TIM13_IRQHandler                 ; TIM13 global interrupt
                DCD     TIM14_IRQHandler                 ; TIM14 global interrupt
                DCD     I3C1_EV_IRQHandler               ; I3C1 Event interrupt
                DCD     I3C1_ER_IRQHandler               ; I3C1 Error interrupt
                DCD     I2C4_EV_IRQHandler               ; I2C4 Event interrupt
                DCD     I2C4_ER_IRQHandler               ; I2C4 Error interrupt
                DCD     LPTIM3_IRQHandler                ; LPTIM3 global interrupt
                DCD     LPTIM4_IRQHandler                ; LPTIM4 global interrupt
                DCD     LPTIM5_IRQHandler                ; LPTIM5 global interrupt
                DCD     LPTIM6_IRQHandler                ; LPTIM6 global interrupt
                DCD     I3C2_EV_IRQHandler               ; I3C2 Event interrupt
                DCD     I3C2_ER_IRQHandler               ; I3C2 Error interrupt
                DCD     COMP_IRQHandler                  ; Comparator global interrupt
                DCD     DMA2D_IRQHandler                 ; DMA2D interrupt
                DCD     JPEG_IRQHandler                  ; JPEG interrupt
                DCD     GPDMA1_Channel8_IRQHandler       ; GPDMA1 channel 8 global interrupt
                DCD     GPDMA1_Channel9_IRQHandler       ; GPDMA1 channel 9 global interrupt
                DCD     GPDMA1_Channel10_IRQHandler      ; GPDMA1 channel 10 global interrupt
                DCD     GPDMA1_Channel11_IRQHandler      ; GPDMA1 channel 11 global interrupt
                DCD     GPDMA2_Channel8_IRQHandler       ; GPDMA2 channel 8 global interrupt
                DCD     GPDMA2_Channel9_IRQHandler       ; GPDMA2 channel 9 global interrupt
                DCD     GPDMA2_Channel10_IRQHandler      ; GPDMA2 channel 10 global interrupt
                DCD     GPDMA2_Channel11_IRQHandler      ; GPDMA2 channel 11 global interrupt
                DCD     GFXTIM_IRQHandler                ; GFXTIM interrupt
                DCD     LCD_IRQHandler                   ; LCD global interrupt
                DCD     LCD_GBL_ERROR_IRQHandler         ; LCD global error interrupt
                DCD     PLAY1_IRQHandler                 ; PLAY global nonsecure interrupt
                DCD     PLAY1_S_IRQHandler               ; PLAY global secure Interrupt
                DCD     ADC3_IRQHandler                  ; ADC3 global Interrupt
                DCD     OCTOSPI2_IRQHandler              ; OCTOSPI2 global interrupt
                DCD     OTFDEC2_IRQHandler               ; OTFDEC2 secure global interrupt
                DCD     FDCAN3_IT0_IRQHandler            ; FDCAN3 Interrupt 0
                DCD     FDCAN3_IT1_IRQHandler            ; FDCAN3_IT1  interrupt
                DCD     MDF1_FLT0_IRQHandler             ; MDF1_FLT0 global interrupt
                DCD     MDF1_FLT1_IRQHandler             ; MDF1_FLT1 global interrupt
                DCD     MDF1_FLT2_IRQHandler             ; MDF1_FLT2 global interrupt
                DCD     MDF1_FLT3_IRQHandler             ; MDF1_FLT3 global interrupt
                DCD     MDF1_FLT4_IRQHandler             ; MDF1_FLT4 global interrupt
                DCD     MDF1_FLT5_IRQHandler             ; MDF1_FLT5 global interrupt
                DCD     ADF1_FLT0_IRQHandler             ; ADF1_FLT0 global interrupt


__Vectors_End

